&НаСервереБезКонтекста
Процедура ОбновитьСтатусЗадач(МассивЗадач, НовыйСтатус)
		УстановитьПривилегированныйРежим(Истина);
	Для каждого ТекЗадача Из МассивЗадач Цикл  
		ЗадачаОбъект = ТекЗадача.ПолучитьОбъект(); 
		Если ЗадачаОбъект.Статус = НовыйСтатус Тогда
			 Продолжить;
		КонецЕсли;
		
		ЗадачаОбъект.Статус = НовыйСтатус; 
		
		Если НовыйСтатус = Перечисления.СтатусыЗадач.Готово Тогда
			 ЗадачаОбъект.Выполнена = Истина;
		КонецЕсли;

		Попытка
			ЗадачаОбъект.Записать();
		Исключение
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не удалось изменить статус задачи " + ТекЗадача + " по причине:" + ОписаниеОшибки();
			Сообщение.Сообщить();
		КонецПопытки;
		
	  
	КонецЦикла;     
		УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры  

&НаКлиенте
Процедура СписокНужноВыполнитьПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	МассивЗадач = ПараметрыПеретаскивания.Значение;
	Если ТипЗНЧ(МассивЗадач) = Тип("Массив") Тогда
		ОбновитьСтатусЗадач(МассивЗадач, ПредопределенноеЗначение("Перечисление.СтатусыЗадач.НужноСделать"));
	КонецЕсли; 
	
	ОповеститьОбИзменении(Тип("ЗадачаСсылка.ЗадачиПользователя"));
КонецПроцедуры

&НаКлиенте
Процедура СписокВРаботеПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	Попытка
	МассивЗадач = ПараметрыПеретаскивания.Значение;
		Если ТипЗНЧ(МассивЗадач) = Тип("Массив") Тогда
			ОбновитьСтатусЗадач(МассивЗадач, ПредопределенноеЗначение("Перечисление.СтатусыЗадач.ВРаботе"));
		КонецЕсли;   
		ОповеститьОбИзменении(Тип("ЗадачаСсылка.ЗадачиПользователя"));
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ОписаниеОшибки();
		Сообщение.Сообщить(); 
		КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура СписокГотовоПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	МассивЗадач = ПараметрыПеретаскивания.Значение;
	Если ТипЗНЧ(МассивЗадач) = Тип("Массив") Тогда
		ОбновитьСтатусЗадач(МассивЗадач, ПредопределенноеЗначение("Перечисление.СтатусыЗадач.Готово"));
	КонецЕсли;      
	ОповеститьОбИзменении(Тип("ЗадачаСсылка.ЗадачиПользователя"));

КонецПроцедуры
